Revit 2025 API
Zone.HeatingSetPoint Property
Get or set the Heating Set Point of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double HeatingSetPoint { get; set; }
Public Property HeatingSetPoint As Double
	Get
	Set
public:
property double HeatingSetPoint {
	double get ();
	void set (double value);
}
member HeatingSetPoint : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Heating Set Point of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace